/**
* 1. 谈谈你对工程化的初步认识，结合你之前遇到过的问题说出三个以上工程化能够解决问题或者带来的价值。
 *
 *  工程化其实更多是解决问题的思想，面对快速发展的技术，不断更迭的框架，以及极大压力的上线任务等等，如何更规范的，更快速的去解决这些问题，就变得非常重要
 *  这就是工程化所要做的事情，从项目创建-编码-调试-测试-部署-上线等等一系列流程提供一套规范的解决方案，从而降低开发人员的成本，提高效率。
* */


/**
 * 2、你认为脚手架除了为我们创建项目结构，还有什么更深的意义？
 *
 *  脚手架的核心功能依然是让开发者能够快速的创建一个项目基础结构，然后在其基础上记性迭代开发，
 *
 *  1。 极大的提高了开发员的开发效率（项目开发更快啦，本地调试也更方便啦），明显降低了开发成本
 *  2。 脚手架也同样提供了一套规范的代码结构，同时也可以采用代码格式化等工具，避免多人协作时，产生不必要的冲突或者问题
 * */


/**
 * 使用gulp构建工作流
 *
 * 构建gulp项目脚手架：https://www.npmjs.com/package/gulp-page-cli
 * 构建gulp工作流：https://www.npmjs.com/package/gulp-config-tool
 * 测试代码：https://github.com/fengyuchaochao/gulp-pages-demo
 *
 * */
